app/controllers/active_stats_controller.rb

SELECT `active_stats`.* FROM `active_stats` WHERE (team_id = '1')
---
  def index
    @active_stats = ActiveStat.all

SELECT `active_stats`.* FROM `active_stats` WHERE `active_stats`.`id` = 1 LIMIT 1
---
  def show
    @active_stat = ActiveStat.find(params[:id])

SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 3 LIMIT 1
SELECT `active_stats`.* FROM `active_stats` WHERE (team_id = '1')
---
  def team
    @team = Team.find(params[:id])
    @active_stats = ActiveStat.where('team_id = ?', params[:id])