app/controllers/teams_controller.rb

  def show
    @team = Team.find(params[:id])
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1

  def edit
    @team = Team.find(params[:id])
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1

  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save
---
INSERT INTO `teams` (`city`, `created_at`, `name`, `owner`, `team_id`, `updated_at`) VALUES ('DC', '2012-02-15 19:07:54', 'AllIDoIsLose', 'James Cline', 1, '2012-02-15 19:07:54')

  def update
    @team = Team.find(params[:id])

    respond_to do |format|
      if @team.update_attributes(params[:team])
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1
UPDATE `teams` SET `name` = 'DownRight DURANTCHULA', `updated_at` = '2012-02-28 16:21:04', `city` = '' WHERE `teams`.`id` = 4